// Створити розмітку з двома текстовими полями та кнопкою.При натисканні на кнопку перевіряти, чи обидва поля містять значення, якщо так, то виводити повідомлення "Обидва поля заповнені", якщо ні — "Не всі поля заповнені".
const x = prompt("Введіть текст");
const y = prompt("Введіть текст");
if (x === "" || y === "") {
    console.log("Не всі поля заповнені");
}
else {
    console.log("Всі поля заповнені");
}
// Створити розмітку  з двома числовими полями та кнопкою.При натисканні на кнопку перевіряти, чи сума значень полів більша за 10, якщо так, то виводити повідомлення "Сума більша за 10", якщо ні — "Сума менша або дорівнює 10".
const a = parseFloat(prompt("Введіть число"));
const b = parseFloat(prompt("Введіть число"));
if (a + b > 10) {
    console.log("Число більше за 10");
}
else {
    console.log("Число менше 10");
}
// Створити розмітку  з текстовим полем та кнопкою.При натисканні на кнопку перевіряти, чи введений текст містить слово "JavaScript", якщо так, то виводити повідомлення "Текст містить слово JavaScript", якщо ні — "Текст не містить слово JavaScript".
const str = prompt("Введіть текст");
if (str.includes("JavaScript") || str.includes("javascript") || str.includes("js")) {
    console.log("текст містить JavaScript")
}
else {
    console.log("текст не містить JavaScript")
}
// Створити розмітку  з формою з полями введення та кнопкою.При натисканні на кнопку перевіряти, чи введене число більше за 10 та менше за 20, якщо так, то виводити повідомлення "Число входить в діапазон від 10 до 20", якщо ні — "Число не входить в діапазон від 10 до 20".
const num = parseFloat(prompt("Введіть число"));
if (num >= 10 && num <= 20) {
    console.log("Число входить в діапазон від 10 до 20")
}
else {
    console.log("Число не входить в діапазон від 10 до 20")
}
// Створити розмітку  з формою з полями введення та кнопкою.При натисканні на кнопку перевіряти, чи введені дані правильно заповнені, якщо так, то перенаправляти на іншу сторінку, якщо ні — виводити повідомлення про помилку.Правильно заповнені дані: ім'я містить не менше 3 символів, email містить символ @ та крапку після неї, пароль містить не менше 6 символів.
const userName = prompt("Введіть ім'я");
const emeil = prompt("Введіть email");
const password = prompt("Введіть пароль");
if (userName.length >= 3 && emeil.includes("@") && password.length >= 6) {
    console.log("Все правильно")
}
else {
    console.log("Error")
}